
#--------------------------------------------------------------------------
# ● require Taroxd基础设置
#    在地图上显示一个简易的血条。
#    如果使用了动态值槽脚本，请将这个脚本放在动态值槽脚本的下方。
#--------------------------------------------------------------------------
  
class Sprite_MapHP < Sprite
  Taroxd::MapHP = self
  #--------------------------------------------------------------------------
  # ● 颜色设定
  #--------------------------------------------------------------------------
  HP_COLOR1 = Color.new(223, 127, 63)
  HP_COLOR2 = Color.new(239, 191, 63)
  BACK_COLOR = Color.new(31, 31, 63)
  #--------------------------------------------------------------------------
  # ● 大小设定
  #--------------------------------------------------------------------------
  WIDTH = 124
  HEIGHT = 100
  #--------------------------------------------------------------------------
  # ● 初始化
  #--------------------------------------------------------------------------
  def initialize(_)
    super
    self.z = 170
    self.bitmap = Bitmap.new(WIDTH, HEIGHT)
  end
  #--------------------------------------------------------------------------
  # ● 更新
  #--------------------------------------------------------------------------
  def update
    hp_rates = get_hp_rates
    if @hp_rates != hp_rates
      @hp_rates = hp_rates
      refresh
    end
  end
  #--------------------------------------------------------------------------
  # ● 刷新
  #--------------------------------------------------------------------------
  def refresh
    bitmap.clear
    @hp_rates.each_with_index do |rate, i|
      fill_w = (width * rate).to_i
      gauge_y = i * 16 + 12
      bitmap.fill_rect(fill_w, gauge_y, WIDTH - fill_w, 6, BACK_COLOR)
      bitmap.gradient_fill_rect(0, gauge_y, fill_w, 6, HP_COLOR1, HP_COLOR2)
    end
  end
  #--------------------------------------------------------------------------
  # ● 释放
  #--------------------------------------------------------------------------
  def dispose
    bitmap.dispose
    super
  end
  #--------------------------------------------------------------------------
  # ● 动态值槽扩展
  #--------------------------------------------------------------------------
  if Taroxd.const_defined?(:RollGauge)
    include Taroxd::RollGauge
    #------------------------------------------------------------------------
    # ● 获取队伍的 HP 比率
    #------------------------------------------------------------------------
    def get_hp_rates
      $game_party.map do |actor|
        t = @gauge_transitions[actor][:hp]
        t.update
        t.value.fdiv(actor.mhp)
      end
    end
  else
    #------------------------------------------------------------------------
    # ● 获取队伍的 HP 比率
    #------------------------------------------------------------------------
    def get_hp_rates
      $game_party.map(&:hp_rate)
    end
  end
end

Spriteset_Map.use_sprite(Sprite_MapHP) { @viewport2 }
